ErpTest/src/DataProcessors/уатТерминалПриемаИВыдачиПутевыхЛистов/уатТерминалПриемаИВыдачиПутевыхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>уатТерминалПриемаИВыдачиПутевыхЛистов</name>
</mdclass:DataProcessor>

ErpTest/src/Enums/уатВидыМоделейТС/уатВидыМоделейТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыМоделейТС</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Автотранспорт</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатВидыСостоянийТС/уатВидыСостоянийТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыСостоянийТС</name>
  <comment>Виды состояний ТС (уат)</comment>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>ВРейсе</name>
    <comment>В рейсе</comment>
  </enumValues>
  <enumValues>
    <name>ВПростое</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
  <enumValues>
    <name>НаКонсервации</name>
  </enumValues>
  <enumValues>
    <name>Выбыло</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/уатАЗС/уатАЗС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатАЗС</name>
  <comment>(уат)</comment>
  <attributes>
    <name>Контрагент_Склад</name>
    <comment>Контрагент / склад</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАЗССклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлВнешнейОбработки</name>
    <comment>Хранилище данных файла внешней обработки</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеГСМ</name>
    <attributes>
      <name>ГСМизФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГСМ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/DataProcessors/уатТерминалПриемаИВыдачиПутевыхЛистов/Forms/ФормаВыбораСправочников/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ИмяОбъектаВыбора") Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.ИмяОбъектаВыбора = "АЗС" Тогда
		Заголовок = "Выберите АЗС";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатАЗС.Ссылка
		|ИЗ
		|	Справочник.уатАЗС КАК уатАЗС
		|ГДЕ
		|	НЕ уатАЗС.ПометкаУдаления
		|	И уатАЗС.ЭтоАЗССклад = &ЭтоАЗССклад
		|УПОРЯДОЧИТЬ ПО
		|	уатАЗС.Наименование");
		Запрос.УстановитьПараметр("ЭтоАЗССклад",
			Параметры.Свойство("ЭтоАЗССклад") И Параметры.ЭтоАЗССклад);
				
	ИначеЕсли Параметры.ИмяОбъектаВыбора = "Прицеп" Тогда
		Заголовок = "Выберите прицеп или оборудование";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	НЕ ТранспортныеСредства.ПометкаУдаления
		|	И (ТранспортныеСредства.уатВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Прицеп)
		|	ИЛИ ТранспортныеСредства.уатВидМоделиТС = ЗНАЧЕНИЕ(Перечисление.уатВидыМоделейТС.Оборудование))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортныеСредства.Наименование");
		
	ИначеЕсли Параметры.ИмяОбъектаВыбора = "УсловиеРаботы" Тогда
		Заголовок = "Выберите условие работы";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатУсловияРаботы.Ссылка
		|ИЗ
		|	Справочник.уатУсловияРаботы КАК уатУсловияРаботы
		|ГДЕ
		|	НЕ уатУсловияРаботы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатУсловияРаботы.Наименование");
				
	ИначеЕсли Параметры.ИмяОбъектаВыбора = "ВидПростоя" Тогда
		Заголовок = "Выберите вид простоя";
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатСостояниеТС.Ссылка
		|ИЗ
		|	Справочник.уатСостояниеТС КАК уатСостояниеТС
		|ГДЕ
		|	НЕ уатСостояниеТС.ПометкаУдаления
		|	И уатСостояниеТС.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.ВПростое)
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатСостояниеТС.Наименование");
				
	Иначе
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Ссылка = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры
